#!/bin/bash

# Перевірка кількості аргументів
if [ "$#" -ne 2 ]; then
    echo "Потрібно ввести шлях і розширення файлів як аргументи"
    echo "Приклад використання: ./script.sh шлях розширення"
    exit 1
fi

# Збереження переданих аргументів
directory=$1
extension=$2

# Перевірка існування директорії
if [ ! -d "$directory" ]; then
    echo "Директорія не існує"
    exit 1
fi

# Пошук файлів з вказаним розширенням у вказаній директорії та підрахунок кількості
file_count=$(find "$directory" -type f -name "*.$extension" | wc -l)

# Виведення кількості знайдених файлів
echo "Кількість файлів з розширенням .$extension у директорії $directory: $file_count"
